// NumericalIntegration.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.


#include <iostream> // Бібліотека введення виведення
#include <Windows.h> // бібліотека для роботи з Windows

using namespace std; // Використання простору імен std

// Функція для обчислення інтегралу методом прямокутників
double rectangular_integration(double a, double b, int n, function<double(double)> f) {
    double h = (b - a) / n; // Ширина кожного прямокутника
    double sum = 0.0; // Змінна для збереження суми площ прямокутників

    for (int i = 0; i < n; ++i) { // Цикл для кожного прямокутника
        double x_i = a + i * h; // Ліва границя прямокутника
        double f_i = f(x_i); // Значення функції в точці x_i
        sum += f_i * h; // Додавання площі поточного прямокутника до суми
    }

    return sum; // Повернення значення інтегралу
}


double f(double x)// функція , яка повертає інтеграл для обчислення
{    
    return x * x * x;// інтеграл для обчислення x^3
}

double metod_trapecii(double c, double d, int n2)// функція для обрахунку методом трапецій
{    
    double h2 = (d - c) / n2;// змінна яка зберігає значення ширини відрізка, яке обчислене за форумлою  
    double sum2 = 0.5 * (f(c) + f(d));  // змінна зберігає остаточну суму, яка обраховує зважену суму за правилом трапецій
    
    for (int i = 1; i < n2; i++)// цикл обчислює значення в кінцях кожного відрізка
    {
        sum2 += f(c + i * h2);
    }
   
    return sum2 * h2; // обчислює заданий інтеграл та повертає його значення
}


int main() 
{
SetConsoleCP(1251);//встановлення кодування українських символів
SetConsoleOutputCP(1251);//встановлення кодування українських символів

int metod, function;// змінні для зберігання вибору користувача
double c, d, res;// оголошення змінних c,d для зберігання нижньої межі та верхньої та результату
int n_2;// оголошення змінної для зберігання кількості відрізків

user( metod, function, c, d, res, n_2 );// виклик функції , яка взаємодіє з користувачем
}
